7767517
95 98
Input            input.1                  0 1 input.1
Padding          Pad_13                   1 1 input.1 100 0=3 1=3 2=3 3=3 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_14                  1 1 100 101 0=32 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4704
GroupNorm        Add_23                   1 1 101 112 0=1 1=32 2=1.000000e-05 3=1
ReLU             LeakyRelu_24             1 1 112 113 0=2.000000e-01
Padding          Pad_38                   1 1 113 136 0=0 1=1 2=0 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_39                  1 1 136 137 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=18432
GroupNorm        Add_48                   1 1 137 148 0=1 1=64 2=1.000000e-05 3=1
ReLU             LeakyRelu_49             1 1 148 149 0=2.000000e-01
Padding          Pad_63                   1 1 149 172 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_64                  1 1 172 173 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
GroupNorm        Add_73                   1 1 173 184 0=1 1=64 2=1.000000e-05 3=1
ReLU             LeakyRelu_74             1 1 184 185 0=2.000000e-01
Padding          Pad_94                   1 1 185 214 0=0 1=1 2=0 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_95                  1 1 214 215 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=73728
GroupNorm        Add_104                  1 1 215 226 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_105            1 1 226 227 0=2.000000e-01
Padding          Pad_119                  1 1 227 250 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_120                 1 1 250 251 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=147456
GroupNorm        Add_129                  1 1 251 262 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_130            1 1 262 263 0=2.000000e-01
Padding          Pad_144                  1 1 263 286 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_145                 1 1 286 287 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=147456
GroupNorm        Add_154                  1 1 287 298 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_155            1 1 298 299 0=2.000000e-01
Convolution      Conv_170                 1 1 299 323 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
GroupNorm        Add_179                  1 1 323 334 0=1 1=256 2=1.000000e-05 3=1
ReLU             LeakyRelu_180            1 1 334 335 0=2.000000e-01
Padding          Pad_194                  1 1 335 358 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_195                 1 1 358 359 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304 7=256
GroupNorm        Add_204                  1 1 359 370 0=1 1=256 2=1.000000e-05 3=1
ReLU             LeakyRelu_205            1 1 370 371 0=2.000000e-01
Convolution      Conv_206                 1 1 371 372 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
GroupNorm        Add_215                  1 1 372 383 0=1 1=256 2=1.000000e-05 3=1
Split            splitncnn_0              1 2 383 383_splitncnn_0 383_splitncnn_1
Convolution      Conv_230                 1 1 383_splitncnn_1 407 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_239                  1 1 407 418 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_240            1 1 418 419 0=2.000000e-01
Padding          Pad_254                  1 1 419 442 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_255                 1 1 442 443 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608 7=512
GroupNorm        Add_264                  1 1 443 454 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_265            1 1 454 455 0=2.000000e-01
Convolution      Conv_266                 1 1 455 456 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_275                  1 1 456 467 0=1 1=256 2=1.000000e-05 3=1
BinaryOp         Add_276                  2 1 383_splitncnn_0 467 468 0=0
Split            splitncnn_1              1 2 468 468_splitncnn_0 468_splitncnn_1
Convolution      Conv_291                 1 1 468_splitncnn_1 492 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_300                  1 1 492 503 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_301            1 1 503 504 0=2.000000e-01
Padding          Pad_315                  1 1 504 527 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_316                 1 1 527 528 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608 7=512
GroupNorm        Add_325                  1 1 528 539 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_326            1 1 539 540 0=2.000000e-01
Convolution      Conv_327                 1 1 540 541 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_336                  1 1 541 552 0=1 1=256 2=1.000000e-05 3=1
BinaryOp         Add_337                  2 1 468_splitncnn_0 552 553 0=0
Split            splitncnn_2              1 2 553 553_splitncnn_0 553_splitncnn_1
Convolution      Conv_352                 1 1 553_splitncnn_1 577 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_361                  1 1 577 588 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_362            1 1 588 589 0=2.000000e-01
Padding          Pad_376                  1 1 589 612 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
ConvolutionDepthWise Conv_377                 1 1 612 613 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608 7=512
GroupNorm        Add_386                  1 1 613 624 0=1 1=512 2=1.000000e-05 3=1
ReLU             LeakyRelu_387            1 1 624 625 0=2.000000e-01
Convolution      Conv_388                 1 1 625 626 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
GroupNorm        Add_397                  1 1 626 637 0=1 1=256 2=1.000000e-05 3=1
BinaryOp         Add_398                  2 1 553_splitncnn_0 637 638 0=0
Padding          Pad_412                  1 1 638 661 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_413                 1 1 661 662 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=294912
GroupNorm        Add_422                  1 1 662 673 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_423            1 1 673 674 0=2.000000e-01
Interp           Resize_436               1 1 674 687 0=2 1=1.000000e+00 2=1.000000e+00 3=512 4=512 6=1
Padding          Pad_450                  1 1 687 710 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_451                 1 1 710 711 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=147456
GroupNorm        Add_460                  1 1 711 722 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_461            1 1 722 723 0=2.000000e-01
Padding          Pad_475                  1 1 723 746 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_476                 1 1 746 747 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=147456
GroupNorm        Add_485                  1 1 747 758 0=1 1=128 2=1.000000e-05 3=1
ReLU             LeakyRelu_486            1 1 758 759 0=2.000000e-01
Interp           Resize_505               1 1 759 778 0=2 1=1.000000e+00 2=1.000000e+00 3=1024 4=1024 6=1
Padding          Pad_519                  1 1 778 801 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_520                 1 1 801 802 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=73728
GroupNorm        Add_529                  1 1 802 813 0=1 1=64 2=1.000000e-05 3=1
ReLU             LeakyRelu_530            1 1 813 814 0=2.000000e-01
Padding          Pad_544                  1 1 814 837 0=1 1=1 2=1 3=1 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_545                 1 1 837 838 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
GroupNorm        Add_554                  1 1 838 849 0=1 1=64 2=1.000000e-05 3=1
ReLU             LeakyRelu_555            1 1 849 850 0=2.000000e-01
Padding          Pad_569                  1 1 850 873 0=3 1=3 2=3 3=3 4=2 5=0.000000e+00 7=0 8=0
Convolution      Conv_570                 1 1 873 874 0=32 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=100352
GroupNorm        Add_579                  1 1 874 885 0=1 1=32 2=1.000000e-05 3=1
ReLU             LeakyRelu_580            1 1 885 886 0=2.000000e-01
Convolution      Conv_581                 1 1 886 887 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=96
UnaryOp          Tanh_582                 1 1 887 888 0=16
